Tekla Open API Reference for Tekla Structures 2025
AnalysisPartSpanningProperties Class
 The AnalysisPartSpanningProperties class contains information related to analysis part spanning properties.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisPartSpanningProperties
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisPartSpanningProperties
Public NotInheritable Class AnalysisPartSpanningProperties
The AnalysisPartSpanningProperties type exposes the following members.
Constructors
Name | Description
AnalysisPartSpanningProperties
Initializes a new instance of the AnalysisPartSpanningProperties class
Top
Properties
Name | Description
SpanningDirection
 The spanning direction (in the global coordinate system).
SpanningType
 The spanning type.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace